Revit 2026 API

# TemporaryViewModesIsModeEnabled Method

---

Tests whether a temporary view mode is currently enabled in the associated view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsModeEnabled(
	TemporaryViewMode mode
)
```
```vb
Public Function IsModeEnabled (
	mode As TemporaryViewMode
) As Boolean
```
```cpp
public:
bool IsModeEnabled(
	TemporaryViewMode mode
)
```
```fsharp
member IsModeEnabled :
        mode : TemporaryViewMode -> bool
```

#### Parameters

mode TemporaryViewMode
     The mode to evaluate

#### Return Value

Boolean True if the requested mode is available and enabled in the associated view; False otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

Most of temporary modes are enabled in a specific context only. A programmer who wants to use a mode needs to first test whether it is currently available and enabled, or not.

#### Reference

TemporaryViewModes Class

Autodesk.Revit.DB Namespace